In [2]:
import pandas as pd
df = pd.read_csv('2018-2019_Daily_Attendance_20240429.csv')

In [4]:
df.head(10)

  School DBN      Date  Enrolled  Absent  Present  Released
0     01M015  20180905       172      19      153         0
1     01M015  20180906       171      17      154         0
2     01M015  20180907       172      14      158         0
3     01M015  20180912       173       7      166         0
4     01M015  20180913       173       9      164         0
5     01M015  20180914       173      11      162         0
6     01M015  20180917       173      10      163         0
7     01M015  20180918       174       7      167         0
8     01M015  20180920       174       7      167         0
9     01M015  20180921       174       8      166         0

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 277153 entries, 0 to 277152
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   School DBN  277153 non-null  object
 1   Date        277153 non-null  int64
 2   Enrolled    277153 non-null  int64
 3   Absent      277153 non-null  int64
 4   Present     277153 non-null  int64
 5   Released    277153 non-null  int64
dtypes: int64(5), object(1)
memory usage: 12.7+ MB

In [6]:
df[['Enrolled','Absent','Present']].describe()

           Enrolled         Absent        Present
count  277153.00000  277153.000000  277153.000000
mean      596.98617      50.503538     544.499403
std       482.90966      54.329671     452.970313
min         1.00000       0.000000       1.000000
25%       329.00000      23.000000     291.000000
50%       476.00000      38.000000     430.000000
75%       684.00000      59.000000     640.000000
max      5955.00000    2151.000000    5847.000000

In [9]:
df[['Enrolled','Present','Absent']]

        Enrolled  Present  Absent
0            172      153      19
1            171      154      17
2            172      158      14
3            173      166       7
4            173      164       9
...          ...      ...     ...
277148       230      136      46
277149       226      128      53
277150       226      130      42
277151       226      127      56
277152       216       68      27

[277153 rows x 3 columns]

In [10]:
df

       School DBN      Date  Enrolled  Absent  Present  Released
0          01M015  20180905       172      19      153         0
1          01M015  20180906       171      17      154         0
2          01M015  20180907       172      14      158         0
3          01M015  20180912       173       7      166         0
4          01M015  20180913       173       9      164         0
...           ...       ...       ...     ...      ...       ...
277148     79X695  20190620       230      46      136        48
277149     79X695  20190621       226      53      128        45
277150     79X695  20190624       226      42      130        54
277151     79X695  20190625       226      56      127        43
277152     79X695  20190626       216      27       68       121

[277153 rows x 6 columns]

In [11]:
df.isnull().sum()

School DBN    0
Date          0
Enrolled      0
Absent        0
Present       0
Released      0
dtype: int64

In [13]:
df.duplicated().sum()

0

In [14]:
df.columns =  df.columns.str.lower()
df.columns = df.columns.str.replace(' ','_')

In [15]:
df.columns

Index(['school_dbn', 'date', 'enrolled', 'absent', 'present', 'released'], dtype='object')

In [16]:
df = df.rename(columns={'school_dbn':'school_id'})

In [17]:
df.columns

Index(['school_id', 'date', 'enrolled', 'absent', 'present', 'released'], dtype='object')

In [18]:
df['date'] = pd.to_datetime(df['date'].astype(str), format='%Y%m%d')

In [20]:
df[['enrolled','date']]

        enrolled       date
0            172 2018-09-05
1            171 2018-09-06
2            172 2018-09-07
3            173 2018-09-12
4            173 2018-09-13
...          ...        ...
277148       230 2019-06-20
277149       226 2019-06-21
277150       226 2019-06-24
277151       226 2019-06-25
277152       216 2019-06-26

[277153 rows x 2 columns]

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 277153 entries, 0 to 277152
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   school_id  277153 non-null  object
 1   date       277153 non-null  datetime64[ns]
 2   enrolled   277153 non-null  int64
 3   absent     277153 non-null  int64
 4   present    277153 non-null  int64
 5   released   277153 non-null  int64
dtypes: datetime64[ns](1), int64(4), object(1)
memory usage: 12.7+ MB

In [22]:
pip install psycopg2-binary sqlalchemy

Requirement already satisfied: psycopg2-binary in c:\users\el3afreet\anaconda3\lib\site-packages (2.9.11)
Requirement already satisfied: sqlalchemy in c:\users\el3afreet\anaconda3\lib\site-packages (2.0.30)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\el3afreet\anaconda3\lib\site-packages (from sqlalchemy) (4.15.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\el3afreet\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)
Note: you may need to restart the kernel to use updated packages.

In [23]:
from sqlalchemy import create_engine
import urllib.parse

#Step1: Connect to PostrgreSQL

username = "postgres"
password = urllib.parse.quote_plus("123Aa@456") #encode special characters '@' of the password
host = "localhost"
port = 5433
database = "schools_students_attendance_db"

engine = create_engine(f"postgresql+psycopg2://{username}:{password}@{host}:{port}/{database}")

#Step2: Load DataFrame into PostgreSQL
table_name = "attendance"
df.to_sql(table_name,engine,if_exists="replace",index=False)
print(f"Data Successfull loaded into table '{table_name}' in database '{database}'")

Data Successfull loaded into table 'attendance' in database 'schools_students_attendance_db'